Ran Plan for 2 projects:

1. dir: `terraform-aws` workspace: `default`
1. dir: `terraform-gcp` workspace: `default`

### 1. dir: `terraform-aws` workspace: `default`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_instance.web_app will be created
+ resource "aws_instance" "web_app" {
      + ami                          = "ami-674cbc1e"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "m5.4xlarge"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tenancy                      = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = true
          + device_name           = "my_data"
          + encrypted             = (known after apply)
          + iops                  = 800
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 1000
          + volume_type           = "io1"
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 50
          + volume_type           = (known after apply)
        }
    }

  # aws_lambda_function.hello_world will be created
+ resource "aws_lambda_function" "hello_world" {
      + arn                            = (known after apply)
      + function_name                  = "hello_world"
      + handler                        = "exports.test"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:lambda:us-east-1:account-id:resource-id"
      + runtime                        = "nodejs12.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

#####

Infracost estimate: monthly cost will increase by .8800% (default branch $736.14 vs current branch $742.64)

--- a/default_branch_infracost.txt
+++ b/current_branch_infracost.txt
+  NAME                                         MONTHLY QTY  UNIT         PRICE   HOURLY COST  MONTHLY COST   
 
   aws_instance.web_app                                                                                      
   ├─ Linux/UNIX usage (on-demand, m5.4xlarge)          730  hours        0.7680       0.7680      560.6400  
@@ -7,12 +7,12 @@
   │  └─ General Purpose SSD storage (gp2)               50  GB-months    0.1000       0.0068        5.0000  
   └─ ebs_block_device[0]                       
      ├─ Provisioned IOPS SSD storage (io1)           1,000  GB-months    0.1250       0.1712      125.0000  
-     └─ Provisioned IOPS                               700  IOPS-months  0.0650       0.0623       45.5000  
-  Total                                                                               1.0084      736.1400  
+     └─ Provisioned IOPS                               800  IOPS-months  0.0650       0.0712       52.0000  
+  Total                                                                               1.0173      742.6400  
                                                                                                             
   aws_lambda_function.hello_world                                                                           
   ├─ Requests                                            -  1M requests  0.2000            -             -  
   └─ Duration                                            -  GB-seconds    2e-05            -             -  
   Total                                                                                    -             -  
                                                                                                             
-  OVERALL TOTAL (USD)                                                                 1.0084      736.1400  
+  OVERALL TOTAL (USD)                                                                 1.0173      742.6400  

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform-aws`
* :put_litter_in_its_place: To **delete** this plan click [here](http://6575a96ef53c:4141/lock?id=infracost%252Fatlantis-demo%252Fterraform-aws%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform-aws`
</details>

---
### 2. dir: `terraform-gcp` workspace: `default`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_compute_instance.instance1 will be created
+ resource "google_compute_instance" "instance1" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = [
          + {
              + count = 4
              + type  = "nvidia-tesla-t4"
            },
        ]
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "n1-standard-32"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "instance1"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags_fingerprint     = (known after apply)
      + zone                 = "us-central1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "debian-cloud/debian-9"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "default"
          + network_ip         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = true
          + on_host_maintenance = (known after apply)
          + preemptible         = true
        }
    }

  # google_dns_record_set.frontend will be created
+ resource "google_dns_record_set" "frontend" {
      + id           = (known after apply)
      + managed_zone = "zone"
      + name         = "frontend.123"
      + project      = (known after apply)
      + rrdatas      = [
          + "123.123.123.123]",
        ]
      + ttl          = 300
      + type         = "A"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

#####

Infracost estimate: monthly cost will increase by 16.9000% (default branch $474.90 vs current branch $555.20)

--- a/default_branch_infracost.txt
+++ b/current_branch_infracost.txt
+  NAME                                               MONTHLY QTY  UNIT        PRICE   HOURLY COST  MONTHLY COST   
 
   google_compute_instance.instance1                                                                              
   ├─ Linux/UNIX usage (preemptible, n1-standard-32)          730  hours       0.3200       0.3200      233.6000  
   ├─ Standard provisioned storage (pd-standard)               10  GiB         0.0400       0.0005        0.4000  
-  └─ NVIDIA Tesla T4 (preemptible)                         2,190  hours       0.1100       0.3300      240.9000  
-  Total                                                                                    0.6505      474.9000  
+  └─ NVIDIA Tesla T4 (preemptible)                         2,920  hours       0.1100       0.4400      321.2000  
+  Total                                                                                    0.7605      555.2000  
                                                                                                                  
   google_dns_record_set.frontend                                                                                 
   └─ Queries                                                   -  1M queries  0.4000            -             -  
   Total                                                                                         -             -  
                                                                                                                  
-  OVERALL TOTAL (USD)                                                                      0.6505      474.9000  
+  OVERALL TOTAL (USD)                                                                      0.7605      555.2000  

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform-gcp`
* :put_litter_in_its_place: To **delete** this plan click [here](http://6575a96ef53c:4141/lock?id=infracost%252Fatlantis-demo%252Fterraform-gcp%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform-gcp`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
